'''
=========================================================    
       @File     : 天眼查.py
       @IDE      : PyCharm
       @Author   : Jing3
       @Date     : 2024/12/31 09:37
       @Desc     : 
=========================================================   
'''
import time
import csv
import requests
import re
import json

f=open('天眼查.csv','w',encoding='utf-8',newline='')
csv_writer = csv.DictWriter(f,fieldnames=['查询关键词','name','base','regLocation','phoneList','alias'])
csv_writer.writeheader()

hh=['辽宁寒武纪电子科技' '辽宁麦塔尔冶金科技' '鞍山全事好' '立山区兴岳网络数...' '沈阳市驴家蔻家香...' '海城市水靓花服饰...'
 '兴程贸易' '奕庆至成' '忠久达' '榕亿跨境' '苏勒德传媒公司' '胜月电子商务' '陕西华昭智戴科技' '秦巴明珠'
 '枝江市籍钻拆商贸' '陕西华智青晟科技' '沃恩尔' '超级帅' '鲁家果业农民合作社' '胜月电子商务' '萨法尔电子' '河南安惠隆贸易'
 '环硕科技' '初心网络' '河南众企' '诺金交通' '申创' '佰洹商贸' '安阳佳世客' '三煌鼎' '安阳市希美望艺术培训'
 '河南肯麦数控刀具' '安阳莱宝' '安阳市龙安区东风...' '北京航天梦想教育...' '安阳文豪' '大鑫环保' '山中有鹿传媒'
 '厦门渚络极贸易' '豫牧人' '内涵商贸' '内黄县迪恒商贸' '汤阴县铭宇信息科技' '合肥都曼' '金枪鱼网络' '小锯鳄' '瑞妍'
 '百泰文楠' '强强科技' '安徽鑫时代信息科技' '果核' '艾卜克斯电子商务' '瑞麟信息' '安徽尺寸企业' '泓基服饰'
 '连云港博图图书' '安徽盖德斯新材料科技' '金枪鱼网络' '好狗' '桐城市超有爱信息科技有限公司' '金枪鱼网络' '诺点科技'
 '中弘羽绒被' '丸姗' '盛世富鑫' '一凌宸飞' '欧博东方' '挑挑科技' 'Suplay' '小牛体育' '伟器天成'
 '北京华青科技有限公司' '深圳青鲨科技有限公司' '北京中喜胜科技' '千明科技' '橙时代' '巧播科技' '北京利浩' '诚筑国际'
 '泽全广告' '贝西科技' '青子未来' '慧普特' '北京鸿达' '力昂健康科技' '铁血网' '时光一百' '华夏志勇' '中建材国贸'
 '一起创天下' '走出去' '北京合力致胜' '北京朴得' '花狐与鲸' '华夏志勇' '铁骊青' '纳博汇' '北京禾知源生物科技'
 '德道电子' '九州志景(北京)' '邸宅之家' '聚路国际贸易有限公司' '亦铭京仁' '兴橙网络' '贝西科技' '欧信宝' '惠泽水务'
 '内蒙古宝益佳商贸' '中科寰宇国际贸易' '从龙跨境科技有限公司' '超宇信息科技' '内蒙古申源博薇科技' '内蒙古鹿鼎科技' '九色鹿'
 '内蒙古申源博薇科技' '包头市未来电子商务' '内蒙古航海家文化传媒' '润溯进出口' '华呈电子商务有限公司' '精筑网络' '河北名剑鞋业'
 '央美人工智能科技雄安' '谧秀科技' '中礼嘉禾' '河北雄安玲瑶商贸' '河北雄安澜昊电子商务' '赤橙' '曲阳县嘉众园林雕...'
 '曲阳新思路园林雕塑' '玉见东方' '乐昆气球' '青胜蓝' '东莉铝箱' '雄安安政工程' '盈汇' '锦美伦' '乐奥'
 '本江优商贸有限公司' '鲲讯跨境电子商务' '中体倍力' '合众纸业' '喜鹊激光' '马扎罗箱包有限公司' '圆美圆' '蕾曼德'
 '保定市晓丹文化用品' '保定得帮箱包制造' '柒捌玖' '宜立贸易' '橙风' '鲸歌时代' '保定瓦勒布朗' '犇腾起重' '河北巴娅'
 '保定豪锐' '里程碑实业' '旭禾' '宏起机电' '宇鹰起重' '保定天微网络科技' '乐融公司' '二柒文化传媒' '宝尊'
 '小溪网络科技' '天尚行箱包' '溪月山跨境电商' '匠欧跨境电商' '河北东恒华耀贸易' '鼎桥' '鑫匠石' '派隆进出口' '石泵机械'
 '百纳起重' '河北禾宸电子商务发展' '威斌皮具' '河北省萱琪网络科技' '工之助' '百祥进出口' '河北铧锋' '保定淞琳贸易有限公司'
 '北京信重国际贸易' '之水溪跨境' '百斯特金属' '依托克伟业' '鼎鑫纺织' '保定昌益' '高鹏机械' '乐腾医疗'
 '保定日玥昇有限公司' '时思' '科勒卫生用品' '卡塔商贸' '保定品顺商贸有限公司' '肇伟和彰商贸有限公司' '东兴塑胶' '康纳一品'
 '旭煌达商贸有限公司' '保定云盈科技有限公司' '双安' '兴勃体育' '中国伊娃服饰' '保定经纬优品' '趵特' '意文科技' '巨凯起重'
 '保定鼎臻' '就线在网络科技' '北京瑶宝祥商贸' '匝美纺织' '意莱兹电子商务公司' '晨宇通信' '同益顺' '北京嵩睿电子商务'
 '保定翰伊森贸易' '执匠箱包' '权助' '保定奥欧优' '保定政瑞' '河北芃萨鞋服有限公司' '猎雕' '保定达泽' '保定英特盛'
 '盛园家居' '远洋科技' '海森华宠' '河北鸿运腾达印刷' '涿州市蓝宇特灯' '河北祁卓泵业有限公司' '荣华园林' '扬润体育'
 '景盛伟业' '中致时盛' '河北德尼米可进出...' '河北恒达' '嘉科网络' '凯利金电子商务' '金才广告' '定州市捷通商贸'
 '天浩化工' '白沟新城袋狼箱包厂' '北京银鹰国际贸易' '希创企逞' '保定白沟新城三华...' '金海腾达' '保定凯禹工艺品制造'
 '聚有量箱包' '瑾瑜箱包制造' '包特优箱包' '保定白沟新城南纹...' '熙潮箱包' '保定云狼户外用品公司' '高碑店市团结路蔓...'
 '维珍文具' '保定盛灿皮具制造' '智宇坤鹏' '盛世之星箱包' '广顺' '旭祺' '广聚乾箱包' '定兴大王箱包店' '青洋'
 '保定明邦皮具制造' '白沟新城晴米运动...' '涞水跃金' '锐安特钛业' '斯帕克实业' '智诚大数据服务' '正欣太乙'
 '陕西致达境通电子科技' '中瑞钛业' '宝鸡瑞利金属有限公司' '宝鸡灵海晟网络' '钛力德公司' '钛运动户外品制造商' '陕西锋辉达通科技'
 '允中实业' '欢乐少网络有限公司' '宝鸡恒星达钛金属贸易' '山东大河数字科技' '滨州森得源电子商务' '青岛泰诺家办资产管理'
 '滨州市竞岚有限公司' '鼎典信息' '天亿青成' '滨州聚弘工贸有限公司' '滨州跨瀛网络销售' '滨州融熠商贸有限公司' '诚通绳网'
 '彩生活物业' '山东正海塑业' '博义飞' '霖圣伊品工作室' '华丰国际贸易' '永菲' '滨州市好伙伴商贸' '宇岳建设' '格润'
 '锦鹏' '菲鸿达电子商务' '鑫盛宇商贸有限公司' '斯旦丁' '海口龙华和宏柒电...' '互惜科技' '惠民星际电子商务'
 '欧强跨境电子商务...' '志诚电镀' '山东壹步柒网络科技' '山东特莱宝环保科技' '邹平共赢电子商务科技' '邹平宝赢电子商务'
 '航远跨境' '青岛万特瑞' '猫小乐商贸' '山东鑫金丰钢铁' '滨州闹特不锈钢制品' '山东斯诺尔电器' '筑梦天下跨境电商服务'
 '番荔枝传媒' '漫天电子商务' '太格' '蚌埠星学国家贸易' '蚌埠鑫玥科技有限公司' '安徽悟德科技有限公司' '厚杨商贸'
 '蚌埠市禹会区韩免...' '蚌埠经济开发区跃...' '安徽魅途' '木木电子商务有限公司' '君子兰' '怀远泊瑞电子商务'
 '安徽恒源药业有限公司' '雅克菱' '上海艺冉贸易' '兮克电子' '凤阳加松新型材料科技' '君盈工艺品有限公司' '蚌埠冠邦商业有限公司'
 '安徽蓝曳电器制造' '莆田市凌成物流' '安徽祈艾特' '艾约塔' '蚌埠莱斯林网络科技' '安徽台创' '水谷' '为爱为家'
 '三界电子商务公司' '贵州诺谷商贸' '北沐贸易' '伦博商务电子有限公司' '麒珏电子' '弘曼达' '腾冲市南红天珠珠宝店'
 '广西三青文化传媒' '佛山市北鲜慧通电子' '赶海人文化传媒' '北海市客需专业设...' '链接跳动' '义乌市堡旦商贸商行' '星愿照明'
 '中树人工智能' '云浚' '万川出海电子商务' '重庆龙拳科技' '鑫凯腾' '弘百瑞' '跨境宝' 'OTOM' '海攀汽车' '重庆骁立'
 '鑫盾' '方猴科技' '鲜冶跨境电商' '百香果科技有限公司' '重庆武中' '重庆星辰伟业科技' '小往科技' '未来智选'
 '重庆福士商贸有限公司' '敦雅' '重庆泰麟达商贸公司' '重庆沃格斯' '重庆时曼银泽有限公司' '瑞浩淋' '茂卓科技' '兰奇尔投资'
 '伟聪睿' '苏禄电商' '渝维进出口贸易' '佳和迹商贸' '重庆易斯特贸易' '烽谊嘉联' '重庆沃鲸电子商务' '聚佳源'
 '重庆聪筑商贸有限公司' '长春金丝路国际贸易' '鲁喆教育' '钜优在线' '长春富隆商贸' '中之鼎经贸' '中城科技'
 '吉林省鲁喆网络科技' '意间云智' '云瑞科技' '飞铭达' '御源堂生物科技' '乐美贸易' '吉林省唐纪电子商务' '乐学办公'
 '蒂燊电子商务' '海奥电子科技' '二道区梵慕首饰手作馆' '瀚潮科技' '永鼎' '胖胖教育' '业之汽配' '上海长煜' '长发网络传媒'
 '哈尔滨市阿城区亚...' '汽车经济技术开发...' '米提卡乐' '吉林省瑞斯特商贸' '吉林省莱施维特医...' '大尼咯科技有限公司'
 '亿沓' '格莱美商用厨房' '九幺三文化传媒' '远舟贸易' '长春境贸信息科技' '晋菘' '满天欣' '吉林省喜荣电子商务' '吉林盛慧'
 '比邻国际' '农安县农安镇塬淇...' '中汽' '汇聚通' '九品互动' '万象国际' '吉林省君源电子商务' '长春市智汇朝阳科...'
 '朝阳聚福网络科技' '碳恒传媒' '成琪电商' '伟睿科技' '派得购跨境电商' '超燃科技' '赛农粮行' '尊臻商务'
 '壹股青流科技有限公司' '内蒙古海森华宠膨...' '灏鑫贸易有限公司' '峰盈权益' '君柏商贸' '承德怡达' '迈迪多商贸'
 '沧州典宁商贸有限公司' '沧州市永胜塑业' '沧州洋帆科技有限公司' '沧州锐驰五金制品...' '优歌贸易' '美拉德' '东茂玻璃'
 '沧州圣彼得电子商务' '前进机械' '河北宇蝶国际贸易' '天华制动' '光速电子' '盈冉' '大宽科技有限公司' '沧州利达塑业'
 '河北瑞冠国际贸易...' '诚筑国际' '沧州洪成管件有限公司' '艾米网络' '阿格贝贝' '河北鸿畴' '莫玉科技' '奇锋汽车配件'
 '河北舶登科技' '菲尼克斯畜牧设备' '泊头市具多商贸中心' '沧州顶拓机械设备' '黎明压型机械' '沃尔卡贸易' '泊头市墩个土墩宠物店'
 '赛维商贸' '雅戈兰电商' '壹本腾电商' '河北楠复堂科技' '黄骅市博然电子商...' '美潮电商' '云维科技'
 '任丘市百自来五金...' '任丘孚兰德' '家睦摩托车' '任丘市泰诺玻纤制品厂' '广鑫商贸有限公司' '任丘市正迈电器'
 '任丘思穗商贸有限公司' '当先机械有限公司' '沧州市盛光电子科技' '智诚电子' '沧州恒纳国际贸易' '辉盛玻璃' '沧州晟煊进出口贸易'
 '君泰' '锦航玻璃' '河间市安卓拉玻璃制品' '河间市安卓拉玻璃制品' '沧州谷得国际贸易' '河北驰运' '大蚁有通电商'
 '沧州柏果跨境行业领先' '河北晨凯宾电力器材' '特斯特集成房屋衡水' '孟村饶安龙工场' '酷悦' '力安消防' '原上贸易' '新域传媒'
 '常州亚购电商' '科赫' '常州市辰禾货通电...' '盛亘泽' '瓦坎达电商' '维吉国际' '威尔莱炉业' '常州喜马拉雅户外用品'
 '红峰塑业' '货通天下' '新北区新桥战斧暴...' '常州阿德法医疗科技' '常州易宝网络有限公司' '泽燕国际' '常州知夏'
 '成蝶跨境电商' '常州淘伴' '培星' '忠煜网络' '新绎美' '常州航梦科技有限公司' '悦昂国际' '常州格蕾丝服饰'
 '常州盛锦电子商务' '悦姿纺织' '迅恒网络' '苍轩道龙文化' '晟火网络' '常州拓客科技有限公司' '大咖教育' '温州浙温视眼健康服务'
 '常州数果科技有限公司' '常州智扬天下网络...' '易曼斯' '虫洞电商' '常州帕利曼娜商贸' '苏邦家居' '常州鲸鱼出海网络科技'
 '欧贸' '艾可' '安盾防护' '江苏元鸿达网络科技' '帛齐纺织' '伏沃德' '常州合杰电机有限...' '恩拓车辆' '锦坤食品机械'
 '瑞因博' '江苏波科马智能制造' '通霸新能源' '恩耐吉' '优创包装科技有限公司' '恩荣液压' '江苏恩斯克' '常州市添琦椅业'
 '常州哲灵' '建伟电器' '常州笑一笑网络科技' '常州奥之刻电子商务' '墨纳密' '丽圆不干胶' '常州帕沃新能源科技'
 '常州鲸跃科技有限公司' '皮尔特机械科技' '迈玛瑞' '腾泽商务' '一骑跑户外用品' '江苏信保通' '润达照明' '盲芯科技'
 '博爵机电' '艾迈' '创青控股' '常州攀升互联网信...' '常州亚森' '常州市润久新材料科技' '东泽绒线' '常州凤驰营销策划'
 '常州创超科技有限公司' '常州唯诺家居' '江苏托特斯' '九城' '森迈网业' '常州市晔特进出口公司' '鑫保通信息技术' '德耐斯'
 '普迪' '易到美电商' '常州唯尔福' '海罗' '福兴' '原研' '常州欧尔孚特' '树袋熊电商' '兴炫德' '越驰' '常州灿搏'
 '沃创电子' '车狼湖汽车零部件' '泽维尔' '常州顺扬' '凌越' '常州旷云新材料科技' '穆桑传媒' '锐戈精密工具' '芬帝克'
 '凯鑫合金' '常州常德网络科技' '江苏威特电子商务' '常州密本文化用品' '江苏喜薰实业' '凌采' '海星' '常州捷诚光电科技'
 '常州富江' '辉睿车业' '达西浓纳米' '江苏松普智能装备...' '亨达' '英莱特进出口有限公司' '常州欣玛森卡科技' '翔瑞圣'
 '澳仕兰' '建铃车辆部件有限公司' '扬州赛力机电有限公司' '路达曼' '威图维亚' '卓登' '常州宜尊电子商务' '斯巴克智控'
 '轩宝丽' '依丽芙' '常州市绿逸汽车配...' '纳什网络' '常州恒仕网络科技' '常州贝欧' '奥恒机械' '艾捷尔'
 '常州明治汽车配件公司' '常州锦美奥科技' '常州苏和车业有限公司' '元棉电子商务' '莫珐莎' '清驰骏商贸' '江苏共跃' '静辉达'
 '珍岛科技' '时氪装备' '禾邦' '鸿海' '英泊索尔' '瑞明药业' '布洛瑟姆' '畅玺进出口' '漫天户外' '融商智投' '酷库数控'
 '精诺工具' '一尊橡塑有限公司' '爱可为' '梦珞车业' '文华医药' '关山悦智能装备' '聚辰车业' '常州只只电子商贸'
 '常州市擎宇车业' '江苏泰然' '添悦国际' 'KING BAY' '全椒安杰亿信' '帆芃跨境电商' '凤达塑业' '天纪科技'
 '安徽斯年传媒' '合灿科技' '睿乐玛' '滁州市恩典电子商务' '睿德装饰' '普利斯特' '安徽科桔电子商务' '南京昌达餐饮管理'
 '亿维医疗' '株洲路依服饰有限公司' '海润天恒' '亿千树' '有成电商' '捷弗士贸易有限公司' '优依乐' '长沙积逊' '小算科技'
 '奥菲诺科技' '湖南艾檬' '索细亚' '小智时代供应链' '湖南洋驼帮' '喜淘跨境' '长沙益壳' '长沙邦佑' '尚策'
 '湖南哟吼网络科技' '牧清枫' '长沙护驹通信息咨询' '湖南世茗电子商务' '豆芽跨境电商' '长沙潜钻工程机械' '亦大电商' '融呈国际'
 '誉文科技' '破晓电商' '泽汇科技' '长沙五六三科技' '湖南特科' '长沙光讯电子商务' '咪咪兔科技' '湖南省五指商电子商务'
 '长沙达不溜易电子商务' '互灵科技' '迪利斯' '长沙乐购时光商务公司' '长沙锐拓' '长沙速七电子商务...' '湖南聚晟跨境电子商务'
 '长沙贰零贰肆跨境...' '长沙彦希瑞思' '第一构想科技' '法歌帝' '信为科技' '广州萝丹商贸有限公司' '深圳来铂科技有限公司'
 '藤文' '钟祥市帝圄英商贸' '佳恩易' '冠锋电子商务有限公司' '长沙斯博曼' '百海汇' '长沙萌宇国际贸易' '长沙贝思特电子'
 '环金网络' '美迈科技' '苔米家' '湖南美爵思科技' '苏帕雷' '长沙巨洋' '兆诺科技' '赛安特' '学米' '深圳市乐盛实业'
 '长沙及时行乐信息科技' '星昂传媒' '长沙捷足科技' '欧微' '长沙市矩阵创新科...' '柒米' '晟新科技' '湾钛科技' '华远嘉达'
 '湖南恒熠电子' '长沙呜酷文化传媒' '优威星科技' '信亚钜合' '老顽童' '肆玖科技' '深圳凌波微步信息技术' '湖南经筵'
 '长沙斯博曼' '美林楷' '长沙律辰' '麦可思科技' '皇凯' '长沙市涌星科技' '卡塞尔' '加度网络' '玖嘉久' '蒲莲子'
 '长沙安佰莉国际贸易' '速猫科技' '湖南相奕科技有限公司' '嘉德集团' '三个太阳' '盎莱' '攸品汇' '和燊商贸' '宇隆贸易'
 '玉承' '唯开电子商务' '前达' '景航科技' '荣亿发科技有限公司' '欧裹国际物流' '智仕科技有限责任公司' '郴州前达网络科技'
 '六感科技' '郴州市桐瑾贸易' '绘星贸易有限公司' '郴州盛世通途' '湖南丹韵新材料' '湖南盾山科技有限公司' '郴州市北湖区元昌...'
 '壹巢电子商务' '常绮贸易' '郴州里奥贸易有限公司' '湖南爱无尽全球旅拍' '郴州市楠一科技' '桂阳菲恪电子商务' '峻喜服饰'
 '利螺丝工贸有限公司' '佳鑫科技' '长沙璟蓉科技有限公司' '万选供应链' '陈妹子食品' '澧县乐家超市' '澧县志诚商贸经营部'
 '广州允尚' '亿跃电子商务有限公司' '常德速盈' '常德市葫芦兄弟汽...' '鲸选全球购' '湖南狸美品牌管理' '江左盟'
 '广州麟栋贸易有限...' '常德九分电子商务' '杰新纺织' '成都驼鹿科技有限公司' '成都洛德岛' '成都七味源生' '南舟数字科技'
 '讯拓' '朔尔思贸易有限公司' '希斯越' '阿里时意' '纽仕达' '瀚汀德' '赛一' '新安特成都分公司' '恩佐科技' '耀辰云创'
 '远读重洋' '成都蜀星饲料' '成都天盈美家信息...' '雅图斯贸易有限公司' '银舵科技' '三益弘创' '丰营电商' '爱特尔'
 '凡西尼' '搜兔科技' '嘉雨恒' '莲强电子商务' '成都邦聚智创科技' '莫勒跨境电商' '成都琪宇进出口有...' '成都彼岸尚美鞋业'
 '小小心愿' '芽塘' '四川傲彤' '成都润泽丰' '淞润' '四川酷班传媒有限公司' '四川誉图博才文化传媒' '成都利骏贸易有限公司'
 '暮澜电商' '果影科技' '艾美时尚' '果动科技' '快易畅' '四川葱懋教育咨询' '硬玩' '盛睿优商贸有限公司' '比得鑫'
 '四川宏创未来' '宁鑫达' '同兴成' '陌上阡' '华律网' '寰宇天下科技有限公司' '捷步科技' '家次方科技有限公司'
 '四川顺天时农业科技' '新铁城' '匠造' '研游学文化旅游公司' '三瓴集团' '源流' '四川鲸奇点' '成都隆易网络科技' '羿扬科技'
 '成都略略惊鸿网络科技' '鲸苇科技' '古蜀味道' '成都汇鸿科技' '勇冠科技' '派派' '饶平瑞思电子商务' '启航科贸' '聆简陶瓷'
 '康乃金' '熙洋贸易' '零致电子商务' '潮州市湘桥区忠慧...' '深圳前海顺风顺水...' '笛笛电子商务有限公司' '潮州市博聪电子厂'
 '商仁行' '潮州市卡思妙贸易' '泰晟' '潮州市星柠厨卫科技' '古舍' '潮州市陶冶文化传播' '潮州溜溜贸易' '全陆通电子科技有...'
 '潮州市麦汇科技' '潮州拓牛网络' '科迪' '潮州市潮安区凤塘...' '雅枫浴室柜' '潮州市湘桥区荣业...' '雅枫卫浴' '祥兴发'
 '神彩' '科泽' '潮州市潮氏网络科技' '潮州市名艺陶瓷科...' '东诗' '雅迪陶瓷' '广东中特不锈钢' '潮州市麦汇科技' '郎之家'
 '家豪洁具' '凌飞陶瓷' '南艺' '一格家' '百灵鸟' '广东金信包装有限公司' '金斯牛' '佛山市炜健枫研磨科技'
 '潮州安益商贸有限公司' '潮州市广盈陶瓷' '瑞利陶瓷' '托瑞斯' '宇泰网' '睿高卫浴' '潮州逊度' '卫浴'
 '潮州市潮安区庵埠...' '潮州市潮安区凤塘...' 'IZNC' '潮州市英歌尼斯卫浴' '潮州市潮安区彩塘...' '广州鹤尚珠宝有限公司'
 '潮州市潮安区浮洋...' '享权陶瓷厂' '金曼夫不锈钢' '潮州胜庆' '金津食品' '黄河' '超阳玻璃制品厂' '东宝集团' '恒好食品'
 '熙盛陶瓷' '深圳市万道顺电子商务' '潮州市枫溪区百粤...' '潮州市凯亚圣卫浴' '达利五金' '潮州市潮安区庵埠...' '海之鹏'
 '优拓' '恒昌达利' '造好家家居用品' '潮州市正心陶瓷' '优拓' '潮州拓牛网络' '广西崇左市欢愉电子商务有限公司' '周礼新材料'
 '德新顺' '慧速世印' '硕央进出口' '大连沃兹跨境电子商务' '大连市天肆电子商务' '柠檬釉跨境电商' '大连五彩国际贸易']
headers = {
    "Accept": "text/html,application/xhtml+xml,application/xml;q=0.9,image/avif,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3;q=0.7",
    "Accept-Language": "zh-CN,zh;q=0.9,en;q=0.8,en-GB;q=0.7,en-US;q=0.6",
    "Cache-Control": "no-cache",
    "Connection": "keep-alive",
    "Pragma": "no-cache",
    "Referer": "https://www.tianyancha.com/",
    "Sec-Fetch-Dest": "document",
    "Sec-Fetch-Mode": "navigate",
    "Sec-Fetch-Site": "same-origin",
    "Sec-Fetch-User": "?1",
    "Upgrade-Insecure-Requests": "1",
    "User-Agent": "Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/132.0.0.0 Safari/537.36 Edg/132.0.0.0",
    "sec-ch-ua": "\"Not A(Brand\";v=\"8\", \"Chromium\";v=\"132\", \"Microsoft Edge\";v=\"132\"",
    "sec-ch-ua-mobile": "?0",
    "sec-ch-ua-platform": "\"Windows\""
}
cookies = {
    "TYCID": "fb562c70733e11efaf3d9f3cb0cb3e6b",
    "CUID": "896180ecfaa6240e13f9370db34653eb",
    "ssuid": "3183649984",
    "_ga": "GA1.2.332962379.1726389985",
    "tyc-user-phone": "%255B%252213437891003%2522%255D",
    "searchSessionId": "1737706704.33272281",
    "HWWAFSESTIME": "1739238896611",
    "HWWAFSESID": "39389fd44c1cf1f332",
    "csrfToken": "ay_NwvEaOAHZal6vbgAzivq5",
    "jsid": "SEO-BING-ALL-SY-000001",
    "Hm_lvt_e92c8d65d92d534b0fc290df538b4758": "1737705825,1739238904",
    "HMACCOUNT": "4D4F61CE5656C745",
    "bannerFlag": "true",
    "sensorsdata2015jssdkcross": "%7B%22distinct_id%22%3A%2215329814%22%2C%22first_id%22%3A%22191f4dc9b07a67-03908a380bcc96e-4c657b58-2073600-191f4dc9b08541%22%2C%22props%22%3A%7B%22%24latest_traffic_source_type%22%3A%22%E8%87%AA%E7%84%B6%E6%90%9C%E7%B4%A2%E6%B5%81%E9%87%8F%22%2C%22%24latest_search_keyword%22%3A%22%E6%9C%AA%E5%8F%96%E5%88%B0%E5%80%BC%22%2C%22%24latest_referrer%22%3A%22https%3A%2F%2Fcn.bing.com%2F%22%7D%2C%22identities%22%3A%22eyIkaWRlbnRpdHlfY29va2llX2lkIjoiMTkxZjRkYzliMDdhNjctMDM5MDhhMzgwYmNjOTZlLTRjNjU3YjU4LTIwNzM2MDAtMTkxZjRkYzliMDg1NDEiLCIkaWRlbnRpdHlfbG9naW5faWQiOiIxNTMyOTgxNCJ9%22%2C%22history_login_id%22%3A%7B%22name%22%3A%22%24identity_login_id%22%2C%22value%22%3A%2215329814%22%7D%2C%22%24device_id%22%3A%22191f4dc9b07a67-03908a380bcc96e-4c657b58-2073600-191f4dc9b08541%22%7D",
    "tyc-user-info": "%7B%22state%22%3A%223%22%2C%22vipManager%22%3A%220%22%2C%22mobile%22%3A%2215804611107%22%2C%22userId%22%3A%2215329814%22%2C%22isExpired%22%3A%220%22%7D",
    "tyc-user-info-save-time": "1739239594935",
    "auth_token": "eyJhbGciOiJIUzUxMiJ9.eyJzdWIiOiIxNTgwNDYxMTEwNyIsImlhdCI6MTczOTIzOTU5MiwiZXhwIjoxNzQxODMxNTkyfQ.0rrnBVa6lTvc8kf88nJh2iEYdsevqH-P5dTXjTKTpya4kTyNyWrZJVm0VH8wN-tGdhy2frwiW2Kbh33OjUtu2w",
    "Hm_lpvt_e92c8d65d92d534b0fc290df538b4758": "1739239596"
}

url = "https://www.tianyancha.com/nsearch"
def get_info(keyword):
    params = {
        "key": keyword
    }
    response = requests.get(url, headers=headers, cookies=cookies, params=params)
    res=re.findall("<script id=\"__NEXT_DATA__\" type=\"application/json\">(.*?)</script>",response.text)[0]
    res_json=json.loads(res)
    # print(response.text)
    companyList=res_json['props']['pageProps']['dehydratedState']['queries'][2]['state']['data']['data']['companyList']
    for i in companyList:
        try:
            name=i.get('name').replace('<em>', '').replace('</em>', '')
        except:
            name=i.get('name')
        base=i.get('base')
        loc=i.get('regLocation')
        phonelist=i.get('phoneList')
        try:
            alias=i['multiMatchField'][0]['content'].replace('<em>', '').replace('</em>', '')
        except:
            alias='暂无'
        format_dict={
            'temu品牌':keyword,
            'name':name,
            'base':base,
            'regLocation':loc,
            'phoneList':phonelist,
            'alias':alias,
        }
        print(format_dict)
        csv_writer.writerow(format_dict)
    # print(res_json.get('props.pageProps.dehydratedState.queries[2].state.data.data.companyList'))

for key in hh:
    print(key)
    get_info(key)
    time.sleep(15)